In [1]:
# içeri doğru gittikçe level artar (outter --- level0)

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series(np.random.randn(9),
                 index = ["a,a,a,b,b,c,c,d,d".split(","),
                          [1,2,3,1,3,1,2,2,3]])

In [4]:
data

a  1    0.351993
   2    1.208115
   3    0.475125
b  1   -0.139731
   3    0.410123
c  1   -0.222833
   2   -0.673011
d  2   -0.371852
   3   -0.179270
dtype: float64

In [5]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [6]:
data["b"]

1   -0.139731
3    0.410123
dtype: float64

In [7]:
data["b":"c"]

b  1   -0.139731
   3    0.410123
c  1   -0.222833
   2   -0.673011
dtype: float64

In [8]:
data.loc[["b","d"]]

b  1   -0.139731
   3    0.410123
d  2   -0.371852
   3   -0.179270
dtype: float64

### Selection is even possible from an “inner” level:

In [9]:
data.loc[:,2]

a    1.208115
c   -0.673011
d   -0.371852
dtype: float64

In [10]:
data.loc["a",2]

1.2081146400851364

In [11]:
data.unstack()

          1         2         3
a  0.351993  1.208115  0.475125
b -0.139731       NaN  0.410123
c -0.222833 -0.673011       NaN
d       NaN -0.371852 -0.179270

In [12]:
data.unstack().stack()

a  1    0.351993
   2    1.208115
   3    0.475125
b  1   -0.139731
   3    0.410123
c  1   -0.222833
   2   -0.673011
d  2   -0.371852
   3   -0.179270
dtype: float64

In [13]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],
['Green', 'Red', 'Green']])

In [14]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [15]:
frame.index.names = ["key1","key2"]
frame.columns.names = ["state","color"]

In [16]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [17]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

## Reordering and Sorting Levels

In [18]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [19]:
frame.swaplevel("key1","key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [20]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

## Summary Statistics by Level

In [21]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [22]:
frame.sum(level = "key2")

C:\Users\sinan\AppData\Local\Temp\ipykernel_16428\1475368661.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level = "key2")

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [23]:
#by the error use this
frame.groupby(level="key2").sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [24]:
frame.groupby(level=1).sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [25]:
frame.sum(level='color', axis=1)

C:\Users\sinan\AppData\Local\Temp\ipykernel_16428\4133796543.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [26]:
# again by the error

In [27]:
frame.groupby("color",axis = 1).sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## Indexing with a DataFrame's Columns

In [28]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
'c': ['one', 'one', 'one', 'two', 'two',
'two', 'two'],
'd': [0, 1, 2, 0, 1, 2, 3]})

In [29]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [30]:
frame2 = frame.set_index(["c","d"])

In [31]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [32]:
# To don't lose colomn values

In [33]:
frame.set_index(["c","d"],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [34]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [35]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 8.2 Combining and Merging Datasets

### Database-Style DataFrame Joins

In [37]:
# Udemy course is very well, Read this

### Combining Data with Overlap

In [45]:
## Read books

## 8.3 Reshaping and Pivoting

### Reshaping with Hierarchical Indexing

In [46]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
index=pd.Index(['Ohio', 'Colorado'], name='state'),
columns=pd.Index(['one', 'two', 'three'],
name='number'))

In [47]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [48]:
result = data.stack()

In [49]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [50]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5